{
  "backend/main.mo": "Actor defining user profiles and attachment storage with access control, supporting CRUD for profiles and file uploads via blob storage mixins.",
  "feature_evidence.json": "Feature evidence report listing feature definitions, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files for reference in build planning.",
  "frontend/index.css": "Tailwind CSS setup defining base variables and theming for light and dark modes.",
  "frontend/index.html": "HTML entry file mounting the React app and loading the main script.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes and wrapping content in a theme provider.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen shown when a user without admin rights attempts to access restricted content.",
  "frontend/src/components/AuthRequiredScreen.tsx": "UI screen prompting unauthenticated users to log in before accessing protected pages.",
  "frontend/src/components/forms/FieldError.tsx": "Shows a small inline form error message with an icon.",
  "frontend/src/components/forms/StarRating.tsx": "Interactive 1–5 star rating input with hover effects, keyboard support, and optional clearing.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button handling authentication state and query cache clearing.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal prompting newly authenticated users to enter their name and save an initial customer profile.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with branding, navigation links, and business contact info.",
  "frontend/src/components/SiteHeader.tsx": "Displays the site header with logo, navigation, auth-aware links, and mobile menu.",
  "frontend/src/components/SiteLayout.tsx": "Wraps pages with the site header, footer, and profile setup dialog.",
  "frontend/src/components/tracking/SchematicTrackingMap.tsx": "Renders a stylized schematic map showing a driver’s normalized live location marker.",
  "frontend/src/content/businessInfo.ts": "Exports static business contact and service info.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing queries when identity changes.",
  "frontend/src/hooks/useAdminGuard.ts": "Checks if the current authenticated caller is an admin and exposes related state.",
  "frontend/src/hooks/useAttachments.ts": "Provides hooks to get or upload user attachments through the backend actor.",
  "frontend/src/hooks/useCallerProfile.ts": "Fetches and saves the caller’s user profile and includes a helper for display names.",
  "frontend/src/hooks/useDriverLocationUpdate.ts": "Updates a driver’s location for a booking and invalidates related tracking queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for booking operations including fetching bookings, submitting bookings, assigning drivers, and updating booking status.",
  "frontend/src/hooks/useRateCard.ts": "Defines hooks to fetch and update the rate card via actor methods with React Query.",
  "frontend/src/hooks/useReferral.ts": "Contains hooks to generate, fetch, and apply referral codes and retrieve referral bonuses using actor calls.",
  "frontend/src/hooks/useTracking.ts": "Exposes polling-enabled hooks to fetch booking details and driver location for live tracking.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles and defines light/dark theme variables with an earthy color palette.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with company story, values, and mission using styled UI components.",
  "frontend/src/pages/admin/AdminBookingsPage.tsx": "Admin interface for viewing all bookings, assigning drivers, and updating rate cards with authentication and guard logic.",
  "frontend/src/pages/BookCabPage.tsx": "Implements a detailed cab booking form with validation, user profile integration, and booking submission logic.",
  "frontend/src/pages/ContactPage.tsx": "Displays a contact page with hero section and cards showing phone, helpline, email, service area, and business hours.",
  "frontend/src/pages/DomainSetupPage.tsx": "Provides a step‑by‑step guide for connecting a custom domain, including notices, registrar suggestions, and DNS setup instructions.",
  "frontend/src/pages/DriverLocationUpdatePage.tsx": "Allows authenticated drivers assigned to a booking to manually update their GPS coordinates with validation and permission checks.",
  "frontend/src/pages/FaqPage.tsx": "Renders a hero section and accordion-based list of common customer FAQs and answers.",
  "frontend/src/pages/FleetPage.tsx": "Shows a hero section and a grid of vehicle types with descriptions, capacities, features, and ideal use cases.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero banner, feature cards, and navigation buttons for booking and services.",
  "frontend/src/pages/PricingPage.tsx": "Displays pricing ranges, factors, inclusions, exclusions, and example fare cards with a disclaimer.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page handling name, payment method, referrals, and document uploads with authentication.",
  "frontend/src/pages/ServicesPage.tsx": "Lists service categories with descriptions and feature lists, plus hero and CTA sections.",
  "frontend/src/pages/TestimonialsPage.tsx": "Shows customer testimonials in a card grid with ratings, quotes, and a hero section.",
  "frontend/src/pages/TrackingPage.tsx": "Displays live booking tracking with authentication checks, booking details, driver location, and status badges.",
  "frontend/src/utils/paymentMethods.ts": "Defines payment method options and provides a helper to map payment enums to user-friendly labels.",
  "frontend/src/utils/principalText.ts": "Validates ICP principal text input and returns parsed principal data or an error message.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based query values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Stores high-level project metadata, feature list, pending requests, and state versioning information."
}