{
  "backend/main.mo": "Motoko canister managing user profiles, access control, and file attachments for customers and drivers.",
  "feature_evidence.json": "Feature evidence report mapping PWA and responsiveness features to related files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend components, hooks, and pages for reference.",
  "frontend/index.css": "Tailwind base styles defining color variables, themes, and global styling for light and dark modes.",
  "frontend/index.html": "Main HTML entry with PWA meta tags, manifest links, and icon references for Android installability.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, start URL, and generated icon assets.",
  "frontend/public/sw.js": "Minimal service worker implementing basic caching and install/activate lifecycle events for PWA support.",
  "frontend/src/App.tsx": "App root configuring TanStack Router routes and registering the service worker for PWA support.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen shown when a user lacks admin permissions, including alert and login button.",
  "frontend/src/components/AuthRequiredScreen.tsx": "Screen prompting unauthenticated users to log in, with explanatory card and login button.",
  "frontend/src/components/forms/FieldError.tsx": "Small component showing an inline validation error with an icon.",
  "frontend/src/components/forms/StarRating.tsx": "Interactive 1–5 star rating input with hover, keyboard support, and optional clearing.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button handling auth state, errors, and query cache clearing.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting authenticated users without a profile to enter and save their name.",
  "frontend/src/components/SiteFooter.tsx": "Footer displaying brand info, navigation links, contact details, and WhatsApp helpers.",
  "frontend/src/components/SiteHeader.tsx": "Responsive site header with logo, navigation, contact info, login, and conditional admin/profile links.",
  "frontend/src/components/SiteLayout.tsx": "Page layout combining header, footer, routed content, and the profile setup dialog.",
  "frontend/src/components/tracking/SchematicTrackingMap.tsx": "Visual map schematic that normalizes coordinates and displays a pulsing driver marker.",
  "frontend/src/content/businessInfo.ts": "Static business contact and service info exported as a config object.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminGuard.ts": "Hook determining authentication and admin status by querying the backend actor.",
  "frontend/src/hooks/useAttachments.ts": "Hooks for fetching and uploading caller attachments via the backend with react-query caching.",
  "frontend/src/hooks/useCallerProfile.ts": "Hooks for loading and saving the caller's user profile and a helper for display name extraction.",
  "frontend/src/hooks/useDriverLocationUpdate.ts": "Provides a mutation to update a driver's location and invalidates related tracking and booking queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider for authentication, managing identity loading, login, and state flags.",
  "frontend/src/hooks/useQueries.ts": "Contains booking-related queries and mutations including fetching, submitting, assigning drivers, and updating booking status with cache invalidation.",
  "frontend/src/hooks/useRateCard.ts": "Fetches and updates the rate card via actor calls, with cache invalidation after updates.",
  "frontend/src/hooks/useReferral.ts": "Handles referral code generation, retrieval, bonus lookup, and applying referral codes using actor-based queries and mutations.",
  "frontend/src/hooks/useTracking.ts": "Provides tracking queries to fetch booking details and driver location with optional polling.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light/dark themes along with mobile-friendly layout adjustments.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AboutPage.tsx": "Displays the company's story, values, and mission using styled sections and icons.",
  "frontend/src/pages/admin/AdminBookingsPage.tsx": "Admin interface for viewing bookings, editing the rate card, and assigning drivers with authentication checks.",
  "frontend/src/pages/BookCabPage.tsx": "Implements a cab booking form with validation, profile-prefilled data, submission handling, and UI components.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact page with hero section and multiple cards showing phone, helpline, WhatsApp, email, service area, and business hours.",
  "frontend/src/pages/DomainSetupPage.tsx": "Displays a domain setup guide with notices and step-by-step instructions for purchasing a domain and configuring DNS.",
  "frontend/src/pages/DriverLocationUpdatePage.tsx": "Provides an authenticated driver interface to validate booking and update their live location with form input and error handling.",
  "frontend/src/pages/FaqPage.tsx": "Shows a FAQ page using an accordion listing common questions and answers about booking and services.",
  "frontend/src/pages/FleetPage.tsx": "Displays a fleet overview with cards describing each vehicle type, its capacity, features, and ideal use cases.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero banner, feature highlights, and navigation buttons for booking and services.",
  "frontend/src/pages/PricingPage.tsx": "Displays pricing ranges, factors affecting fares, and example cost cards with a disclaimer.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page handling identity checks, payment method updates, referral code actions, and file uploads for attachments.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a grid of available cab services with icons, descriptions, and feature lists.",
  "frontend/src/pages/TestimonialsPage.tsx": "Renders customer testimonials with ratings and a structured card layout.",
  "frontend/src/pages/TrackingPage.tsx": "Tracks a booking by ID, showing booking details, status, driver location, and loading/error states.",
  "frontend/src/utils/paymentMethods.ts": "Defines payment method options and provides helpers for retrieving payment method labels.",
  "frontend/src/utils/principalText.ts": "Validates and parses principal ID text into a Principal object with basic error reporting.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters using both URL and sessionStorage.",
  "frontend/src/utils/whatsapp.ts": "Builds WhatsApp contact URLs and formats numbers based on business info.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Describes project state, existing PWA features, requirements, and metadata for the AASRA Cab App."
}