{
  "backend/main.mo": "Defines the main actor with user profiles, payment method support, attachment storage, and access‑controlled APIs for managing profiles and uploads.",
  "backend/migration.mo": "Provides a migration function converting old user profiles to the new format by adding a nullable preferred payment method field.",
  "feature_evidence.json": "Lists feature evidence mapping payment‑method‑related features to impacted frontend files and components with confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files describing their responsibilities and structure.",
  "frontend/index.css": "Defines global Tailwind CSS variables and theme settings for light and dark modes.",
  "frontend/index.html": "Base HTML file bootstrapping the React app with a root div and module script entry point.",
  "frontend/src/App.tsx": "Sets up the application router and theme provider, declaring all site routes and linking them to components.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access‑denied message with a login button for unauthorized admin access attempts.",
  "frontend/src/components/AuthRequiredScreen.tsx": "Shows a login prompt for users attempting to access authenticated pages without being signed in.",
  "frontend/src/components/forms/FieldError.tsx": "Displays a small error message with an icon for form fields.",
  "frontend/src/components/forms/StarRating.tsx": "Provides an interactive optional 1–5 star rating input with keyboard and hover support.",
  "frontend/src/components/LoginButton.tsx": "Implements an Internet Identity login/logout button with automatic query cache clearing and error handling.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog prompting new authenticated users to enter and save their name when no profile exists.",
  "frontend/src/components/SiteFooter.tsx": "Renders the footer with brand info, navigation links, and contact details using businessInfo data.",
  "frontend/src/components/SiteHeader.tsx": "Renders the site header with navigation, authentication-aware links, contact info, and a mobile menu.",
  "frontend/src/components/SiteLayout.tsx": "Defines the main page layout including header, footer, outlet content, and a profile setup dialog.",
  "frontend/src/content/businessInfo.ts": "Exports static business contact and service information.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminGuard.ts": "Checks authentication and determines whether the current caller is an admin.",
  "frontend/src/hooks/useAttachments.ts": "Manages fetching and uploading user attachments via the backend, including progress support.",
  "frontend/src/hooks/useCallerProfile.ts": "Fetches and updates the caller's user profile and provides a helper to extract display names.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state management using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Handles fetching and submitting booking data through the backend actor.",
  "frontend/src/hooks/useRateCard.ts": "Fetches and updates the rate card data via the backend actor.",
  "frontend/src/hooks/useReferral.ts": "Provides React Query hooks to generate, fetch, apply referral codes and retrieve referral bonuses via the actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark mode color themes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with hero section, company story, values, and mission information.",
  "frontend/src/pages/admin/AdminBookingsPage.tsx": "Admin page that loads bookings, user profile, and rate card data, enforces admin access, and provides UI to view bookings and update rate card pricing.",
  "frontend/src/pages/BookCabPage.tsx": "Implements a detailed cab booking form with validation, user profile prefill, and booking submission.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information cards including phone, email, helpline, service area, and business hours.",
  "frontend/src/pages/FaqPage.tsx": "Shows an FAQ section using an accordion with common questions and answers about services.",
  "frontend/src/pages/FleetPage.tsx": "Renders a fleet overview page showing various vehicle types with features, capacity, and descriptions in a grid of cards.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with a hero banner, feature highlights, navigation buttons, and promotional imagery.",
  "frontend/src/pages/PricingPage.tsx": "Displays pricing info including factors, example fare ranges, inclusions, and exclusions using cards and alerts.",
  "frontend/src/pages/ProfilePage.tsx": "Provides a user profile management page with fields for name, payment method, referrals, and document uploads, using multiple hooks for backend data.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a grid of service offerings such as airport transfers, outstation trips, and corporate services, each with descriptions and feature lists.",
  "frontend/src/pages/TestimonialsPage.tsx": "Renders a testimonials page with a hero section, grid of customer reviews, and CTA section using static testimonial data.",
  "frontend/src/utils/paymentMethods.ts": "Defines payment method options and a helper to retrieve display labels for payment methods.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata describing existing features, new feature requests, issues, and architectural notes for the Aasra Cab Portal."
}