{
  "backend/main.mo": "Defines user profiles, attachments, booking status, and exposes authorized APIs for managing profiles and uploading or fetching attachments using access control and storage mixins.",
  "backend/migration.mo": "Provides a migration function converting old flat user profiles into new customer/driver variant profiles.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files describing their responsibilities across UI, pages, hooks, and components.",
  "frontend/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes, applying shared UI tokens.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with all site routes and wraps the application in the ThemeProvider.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access denied alert with an admin login button for unauthorized users.",
  "frontend/src/components/AuthRequiredScreen.tsx": "Shows an authentication-required card prompting users to log in to access protected pages.",
  "frontend/src/components/forms/FieldError.tsx": "Shows a small error message with an icon for form fields.",
  "frontend/src/components/forms/StarRating.tsx": "Interactive 1–5 star rating input with hover effects, keyboard support, and optional clearing.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity login/logout with visual states and query cache clearing on logout.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts newly authenticated users without profiles to enter and save their name using profile API hooks.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with brand info, navigation links, and business contact details.",
  "frontend/src/components/SiteHeader.tsx": "Displays the site header with navigation, login/profile/admin controls, and mobile menu.",
  "frontend/src/components/SiteLayout.tsx": "Wraps the page layout with header, footer, and main content outlet including profile setup dialog.",
  "frontend/src/content/businessInfo.ts": "Exports static business contact and service information.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates queries when it changes.",
  "frontend/src/hooks/useAdminGuard.ts": "Checks authentication and queries whether the current caller is an admin.",
  "frontend/src/hooks/useAttachments.ts": "Provides hooks to fetch and upload user attachments using the backend actor.",
  "frontend/src/hooks/useCallerProfile.ts": "Fetches and saves the caller’s user profile and includes a helper to extract display names.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, login, persistence, and identity state management.",
  "frontend/src/hooks/useQueries.ts": "Provides booking-related queries and mutations including list, fetch by ID, and submit.",
  "frontend/src/hooks/useRateCard.ts": "Fetches and updates the backend rate card using react‑query hooks.",
  "frontend/src/hooks/useReferral.ts": "Provides React Query hooks to generate, fetch, apply referral codes and fetch referral bonuses via the actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes with an earthy color palette.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity providers before rendering the main App component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with sections for hero content, company story, values, and mission using styled UI components.",
  "frontend/src/pages/admin/AdminBookingsPage.tsx": "Admin interface to view bookings, manage rate cards, and handle authentication/authorization checks.",
  "frontend/src/pages/BookCabPage.tsx": "Implements a cab booking form with validation, state management, rating inputs, and submission via a booking mutation.",
  "frontend/src/pages/ContactPage.tsx": "Displays business contact information using cards for phone, helpline, email, service area, and hours.",
  "frontend/src/pages/FaqPage.tsx": "Shows a list of frequently asked questions using an accordion component for expandable answers.",
  "frontend/src/pages/FleetPage.tsx": "Displays a fleet list with vehicle details and renders a grid of cards showing capacity, luggage, features, and ideal uses.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero, features, and CTAs, using navigation to booking and services pages.",
  "frontend/src/pages/PricingPage.tsx": "Shows pricing ranges, factors, inclusions, and exclusions with explanatory cards and alerts.",
  "frontend/src/pages/ProfilePage.tsx": "User profile management page handling identity, profile saving, referral codes, and attachment uploads.",
  "frontend/src/pages/ServicesPage.tsx": "Renders a grid of service offerings with icons, descriptions, and feature lists, plus a hero and CTA section.",
  "frontend/src/pages/TestimonialsPage.tsx": "Renders a testimonials page showing customer reviews in a card grid with a hero and CTA section.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with sessionStorage fallbacks.",
  "frontend/tailwind.config.js": "Tailwind configuration defining themes, colors, animations, and plugins for the frontend UI.",
  "project_state.json": "Project metadata describing existing features, pending feature requests, and architectural notes."
}