{
  "kind": "build_request",
  "title": "Make the web app installable as an Android-friendly PWA",
  "projectName": "AASRA Cab App",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add Progressive Web App (PWA) support so the existing AASRA cab web app can be installed and used like an Android app (Add to Home Screen), including a web app manifest, required Android icon sizes, and appropriate HTML meta tags.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Android app"
        ]
      },
      "acceptanceCriteria": [
        "A valid web app manifest is present and linked from the app HTML.",
        "The manifest includes at least name, short_name, start_url, display (standalone), theme_color, background_color, and icons.",
        "At least one 192x192 and one 512x512 app icon are available and referenced by the manifest.",
        "The app shows as installable in a modern Android browser (e.g., Chrome) and launches in standalone mode when installed."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the installed PWA experience works well on Android by verifying key screens are responsive and touch-friendly (header navigation, booking flow, contact options, and tracking screens) and that content is not clipped on small viewports.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Android app"
        ]
      },
      "acceptanceCriteria": [
        "Core pages (Home, Book a Cab, Contact, Tracking, Profile) are usable on common Android viewport widths without horizontal scrolling.",
        "Tap targets in the header/mobile menu and primary CTAs are comfortably clickable on touch devices.",
        "No critical UI elements are obscured by fixed/sticky UI on small screens."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add the generated PWA icon assets into the project as static files under frontend/public/assets/generated and reference them from the PWA manifest.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Android app"
        ]
      },
      "acceptanceCriteria": [
        "New icon files exist under frontend/public/assets/generated.",
        "The manifest references the icons using correct paths and sizes."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn UI sources must be composed, not modified).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/main.tsx (immutable paths).",
    "Backend remains a single Motoko actor in backend/main.mo; no additional backend services."
  ],
  "nonGoals": [
    "Building or publishing a native Android APK/AAB to the Google Play Store.",
    "Adding push notifications or real-time WebSocket features as part of the Android effort."
  ],
  "imageRequirements": {
    "required": [
      "Square app icon with a clean, modern cab/travel mark and warm earthy palette (pwa-icon-192.dim_192x192.png)",
      "Square app icon with a clean, modern cab/travel mark and warm earthy palette (pwa-icon-512.dim_512x512.png)",
      "Maskable square app icon variant with generous safe area and warm earthy palette (pwa-maskable-512.dim_512x512.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}