{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Domain Setup Guide Page + Footer Link",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a new Domain Setup guide page describing external domain purchase and DNS configuration for pointing a custom domain to the Internet Computer app.",
      "acceptanceCriteria": [
        "A new route is available (e.g., \"/domain-setup\") that renders a Domain Setup guide page.",
        "The page content includes: (1) buy domain instructions, (2) DNS configuration steps, and (3) a clear note that the app cannot directly purchase domains.",
        "All user-facing copy on the page is in English.",
        "The page uses existing UI components/styling conventions (Tailwind + shadcn) and is readable on mobile and desktop."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DomainSetupPage.tsx",
          "operation": "create",
          "description": "Add a new Domain Setup guide page in English with step-by-step sections for (1) purchasing a domain via any registrar (explicitly stating purchase/billing happen outside the app), and (2) configuring DNS records to point the domain to the deployed Internet Computer app (include practical steps, common record types, and verification tips). Use existing Tailwind styling conventions and compose shadcn-ui components (e.g., Card/Accordion/Alert) to keep content scannable and mobile-friendly. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new Domain Setup page into TanStack Router by importing the page component and adding a \"/domain-setup\" route to the route tree so it is navigable without a full page reload."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a footer navigation link to the Domain Setup page.",
      "acceptanceCriteria": [
        "The footer includes a visible “Domain Setup” link.",
        "Clicking the link navigates to the Domain Setup page without a full page reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SiteFooter.tsx",
          "operation": "modify",
          "description": "Add a visible \"Domain Setup\" Link (TanStack Router Link) in the footer under the Support or Quick Links list, pointing to \"/domain-setup\", matching existing styling and hover/active behaviors. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}