{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Aasra Cab Portal — Saved payment method in profile and defaulted on booking form",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Add a Payment Method section on the authenticated Profile page to select and save a preferred payment method via existing profile save flow.",
      "acceptanceCriteria": [
        "Profile page displays the currently saved preferred payment method (or shows it as not set).",
        "User can select a preferred payment method and save it using existing profile save flow and React Query invalidation/refetch patterns.",
        "User-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/paymentMethods.ts",
          "operation": "create",
          "description": "Add a shared, non-sensitive list of supported payment method values and English labels (e.g., Cash, UPI, Credit Card, Debit Card) to be reused by Profile and Booking UI to stay consistent."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Add a \"Payment Method\" section to the Profile page UI. Use shadcn-ui form building blocks (e.g., Card/Label/Select or RadioGroup) to let the user choose a preferred payment method from the shared list, show the currently saved value or \"Not set\", and persist it by extending the existing saveCallerUserProfile mutation payload (while keeping the existing React Query invalidation/refetch behavior). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Preselect the booking form payment method from the signed-in user’s saved preferred payment method when available, while still allowing edits before submit.",
      "acceptanceCriteria": [
        "If the caller has a preferred payment method saved, Book a Cab page initializes the payment method radio group to that value.",
        "If no preferred payment method is saved, the payment method starts blank and the existing validation continues to require selection.",
        "Submitting a booking continues to store the chosen paymentMethod on the BookingRequest exactly as selected on the form."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BookCabPage.tsx",
          "operation": "modify",
          "description": "Fetch the caller profile via the existing useGetCallerUserProfile hook and, once loaded, initialize the booking form payment method to the saved preferred payment method only when the form value is still blank (so user changes are preserved). Update the payment method RadioGroup options to use the shared payment-method list values/labels, and ensure submission continues to pass bookingRequest.paymentMethod exactly as the currently selected form value. Use the shadcn-ui RadioGroup component already present. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/paymentMethods.ts",
          "operation": "modify",
          "description": "Ensure the shared payment method list includes all values used by the booking form RadioGroup so profile preference can be applied directly without value mapping."
        }
      ]
    }
  ]
}